/*
* Copyright(C) 2012 FUJITSU TEN LIMITED
*
* This program is free software; you can redistribute it and/or
* modify it under the terms of the GNU General Public License
* as published by the Free Software Foundation; version 2
* of the License.
*
* This program is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
* GNU General Public License for more details.
*
* You should have received a copy of the GNU General Public License
* along with this program; if not, write to the Free Software
* Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
*/

/****************************************************************************
*																			*
*		シリーズ名称	: ＦＴ－Ａ－ＤＡシリーズ							*
*		マイコン名称	: 共通												*
*		オーダー名称	: プラットフォーム部								*
*		ブロック名称	: 共通												*
*		DESCRIPTION		: メッセージインターフェース定義					*
*																			*
*		ファイル名称	: PfIfMsg.h											*
*		作	 成	  者	: TJ ****											*
*		作　 成　 日	: 2012/0x/xx	<Ver. 0.00.00>						*
*		改　 訂　 日	: 2012/07/11	<Ver. 0.10.00>						*
*																			*
****************************************************************************/
#ifndef __PfIfMsg_H__
#define	__PfIfMsg_H__
/* 14A-DA 2012.07.30 DEL-S */
#if 0
#include	"StdGType.h"
#include	"StdSystm.h"
#include	"StdPrjct.h"
#endif
/* 14A-DA 2012.07.30 DEL-E */
/*==========================================================================*/
/*																			*/
/*					内部メッセージ											*/
/*																			*/
/*==========================================================================*/
/*----------------------------------------------------------------------*/
/*	【初期化開始】														*/
/*		ＦＲＯＭ	：ＢＳＭ											*/
/*		ＴＯ		：ＢＩＦ											*/
/*----------------------------------------------------------------------*/
/* イベントコード */
#define		BTM_EVE_INIT_REQ			0x0001

/* 起動Modeをパラメタ1にて渡す */

/*----------------------------------------------------------------------*/
/*	【初期化完了】														*/
/*		ＦＲＯＭ	：ＢＩＦ											*/
/*		ＴＯ		：ＢＳＭ											*/
/*----------------------------------------------------------------------*/
/* イベントコード */
#define		BTM_EVE_INIT_RSP			0x0002

/*----------------------------------------------------------------------*/
/*	【コマンド送受信】													*/
/*		ＦＲＯＭ	：ＢＳＭ											*/
/*		ＴＯ		：ＢＩＦ											*/
/*----------------------------------------------------------------------*/
/* イベントコード */
#define		BTM_EVE_MESSAGE_REQ			0x0003

/*----------------------------------------------------------------------*/
/*	【コマンド送受信】													*/
/*		ＦＲＯＭ	：ＢＩＦ											*/
/*		ＴＯ		：ＢＳＭ											*/
/*----------------------------------------------------------------------*/
/* イベントコード */
#define		BTM_EVE_MESSAGE_RSP			0x0004

/*----------------------------------------------------------------------*/
/*	【コマンド送受信】													*/
/*		ＦＲＯＭ	：ＢＳＭ											*/
/*		ＴＯ		：ＢＩＦ											*/
/*----------------------------------------------------------------------*/
/* イベントコード */
#define		BTM_EVE_BIF_MESSAGE_REQ		0x0005

/*----------------------------------------------------------------------*/
/*	【コマンド送受信】													*/
/*		ＦＲＯＭ	：ＢＩＦ											*/
/*		ＴＯ		：ＢＳＭ											*/
/*----------------------------------------------------------------------*/
/* イベントコード */
#define		BTM_EVE_BIF_MESSAGE_RSP		0x0006

/*----------------------------------------------------------------------*/
/*	【コマンド送受信】													*/
/*		ＦＲＯＭ	：ＢＳＭ											*/
/*		ＴＯ		：ＢＩＦ											*/
/*----------------------------------------------------------------------*/
/* イベントコード */
#define		BTM_EVE_CO_EX_MESSAGE_REQ	0x0007

/* 14A-DA 2012.07.30 ADD-S */
/*----------------------------------------------------------------------*/
/*	【初期化開始】														*/
/*		ＦＲＯＭ	：ＢＳＭ											*/
/*		ＴＯ		：ＢＩＦ											*/
/*----------------------------------------------------------------------*/
/* イベントコード */
#define		BTM_EVE_STOP_REQ			0x0008

/*----------------------------------------------------------------------*/
/*	【コマンド送受信】													*/
/*		SOCKET PATH定義													*/
/*----------------------------------------------------------------------*/
#define BSM_DIR					"/data/misc/dabluetoothd"
#define BSM_SOCKET_PATH			BSM_DIR"/socket"
#define BSM_RSP_BUFFER_SIZE		2048

/*----------------------------------------------------------------------*/
/*	【コマンド送受信】													*/
/*		SOCKETヘッダー													*/
/*----------------------------------------------------------------------*/
typedef struct {
	WORD	event;						/* イベントコード				*/
	WORD	reserve;					/* 予約							*/
	INT		size;						/* 付加データサイズ				*/
} BSM_SOCKET_HEADER;
/* 14A-DA 2012.07.30 ADD-E */

/************************************************************************
*																		*
*			Ｐrototype Ｄeclare Ｓection								*
*																		*
************************************************************************/


/*--------* Ｅnd of Ｐrototype Ｄeclare Ｓection *----------------------*/

#endif	/* __PfIfMsg_H__ */
/****************************************************************************
*						PFIfMsg.h	END										*
****************************************************************************/
